Tekla Open API Reference for Tekla Structures 2025
Distance.FromFractionalFeetAndInchesString Method
Overload List
Name | Description
FromFractionalFeetAndInchesString(String)
 Creates a distance from a string representation of fractional feet and inches.
FromFractionalFeetAndInchesString(String, IFormatProvider, Distance.UnitType)
 Creates a distance from a string representation of fractional feet and inches.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace